{
    "architectures": [
        "Qwen3_5ForConditionalGeneration"
    ],
    "dtype": "bfloat16",
    "image_token_id": 248056,
    "language_model_only": false,
    "model_type": "qwen3_5",
    "text_config": {
        "attention_bias": false,
        "attention_dropout": 0.0,
        "attn_output_gate": true,
        "bos_token_id": 248044,
        "dtype": "bfloat16",
        "eos_token_id": 248044,
        "full_attention_interval": 4,
        "head_dim": 256,
        "hidden_act": "silu",
        "hidden_size": 5120,
        "initializer_range": 0.02,
        "intermediate_size": 17408,
        "layer_types": [
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention",
            "linear_attention",
            "linear_attention",
            "linear_attention",
            "full_attention"
        ],
        "linear_conv_kernel_dim": 4,
        "linear_key_head_dim": 128,
        "linear_num_key_heads": 16,
        "linear_num_value_heads": 48,
        "linear_value_head_dim": 128,
        "mamba_ssm_dtype": "float32",
        "max_position_embeddings": 262144,
        "model_type": "qwen3_5_text",
        "mtp_num_hidden_layers": 1,
        "mtp_use_dedicated_embeddings": false,
        "num_attention_heads": 24,
        "num_hidden_layers": 64,
        "num_key_value_heads": 4,
        "output_gate_type": "swish",
        "pad_token_id": null,
        "partial_rotary_factor": 0.25,
        "rms_norm_eps": 1e-06,
        "rope_parameters": {
            "mrope_interleaved": true,
            "mrope_section": [
                11,
                11,
                10
            ],
            "partial_rotary_factor": 0.25,
            "rope_theta": 10000000,
            "rope_type": "default"
        },
        "tie_word_embeddings": false,
        "use_cache": true,
        "vocab_size": 248320
    },
    "tie_word_embeddings": false,
    "transformers_version": "5.8.0",
    "video_token_id": 248057,
    "vision_config": {
        "deepstack_visual_indexes": [],
        "depth": 27,
        "dtype": "bfloat16",
        "hidden_act": "gelu_pytorch_tanh",
        "hidden_size": 1152,
        "in_channels": 3,
        "initializer_range": 0.02,
        "intermediate_size": 4304,
        "model_type": "qwen3_5_vision",
        "num_heads": 16,
        "num_position_embeddings": 2304,
        "out_hidden_size": 5120,
        "patch_size": 16,
        "spatial_merge_size": 2,
        "temporal_patch_size": 2
    },
    "vision_end_token_id": 248054,
    "vision_start_token_id": 248053,
    "quantization_config": {
        "config_groups": {
            "group_0": {
                "input_activations": {
                    "dynamic": false,
                    "num_bits": 4,
                    "type": "float",
                    "group_size": 16
                },
                "weights": {
                    "dynamic": false,
                    "num_bits": 4,
                    "type": "float",
                    "group_size": 16
                },
                "targets": [
                    "Linear"
                ]
            }
        },
        "ignore": [
            "lm_head",
            "model.language_model.layers.0.linear_attn.conv1d",
            "model.language_model.layers.1.linear_attn.conv1d",
            "model.language_model.layers.10.linear_attn.conv1d",
            "model.language_model.layers.12.linear_attn.conv1d",
            "model.language_model.layers.13.linear_attn.conv1d",
            "model.language_model.layers.14.linear_attn.conv1d",
            "model.language_model.layers.16.linear_attn.conv1d",
            "model.language_model.layers.17.linear_attn.conv1d",
            "model.language_model.layers.18.linear_attn.conv1d",
            "model.language_model.layers.2.linear_attn.conv1d",
            "model.language_model.layers.20.linear_attn.conv1d",
            "model.language_model.layers.21.linear_attn.conv1d",
            "model.language_model.layers.22.linear_attn.conv1d",
            "model.language_model.layers.24.linear_attn.conv1d",
            "model.language_model.layers.25.linear_attn.conv1d",
            "model.language_model.layers.26.linear_attn.conv1d",
            "model.language_model.layers.28.linear_attn.conv1d",
            "model.language_model.layers.29.linear_attn.conv1d",
            "model.language_model.layers.30.linear_attn.conv1d",
            "model.language_model.layers.32.linear_attn.conv1d",
            "model.language_model.layers.33.linear_attn.conv1d",
            "model.language_model.layers.34.linear_attn.conv1d",
            "model.language_model.layers.36.linear_attn.conv1d",
            "model.language_model.layers.37.linear_attn.conv1d",
            "model.language_model.layers.38.linear_attn.conv1d",
            "model.language_model.layers.4.linear_attn.conv1d",
            "model.language_model.layers.40.linear_attn.conv1d",
            "model.language_model.layers.41.linear_attn.conv1d",
            "model.language_model.layers.42.linear_attn.conv1d",
            "model.language_model.layers.44.linear_attn.conv1d",
            "model.language_model.layers.45.linear_attn.conv1d",
            "model.language_model.layers.46.linear_attn.conv1d",
            "model.language_model.layers.48.linear_attn.conv1d",
            "model.language_model.layers.49.linear_attn.conv1d",
            "model.language_model.layers.5.linear_attn.conv1d",
            "model.language_model.layers.50.linear_attn.conv1d",
            "model.language_model.layers.52.linear_attn.conv1d",
            "model.language_model.layers.53.linear_attn.conv1d",
            "model.language_model.layers.54.linear_attn.conv1d",
            "model.language_model.layers.56.linear_attn.conv1d",
            "model.language_model.layers.57.linear_attn.conv1d",
            "model.language_model.layers.58.linear_attn.conv1d",
            "model.language_model.layers.6.linear_attn.conv1d",
            "model.language_model.layers.60.linear_attn.conv1d",
            "model.language_model.layers.61.linear_attn.conv1d",
            "model.language_model.layers.62.linear_attn.conv1d",
            "model.language_model.layers.8.linear_attn.conv1d",
            "model.language_model.layers.9.linear_attn.conv1d",
            "model.visual*",
            "mtp.layers.0*"
        ],
        "quant_algo": "NVFP4",
        "producer": {
            "name": "modelopt",
            "version": "0.43.0"
        },
        "quant_method": "modelopt"
    }
}